{"config": [{"config": {"dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "batch_input_shape": [null, 150, 150, 3], "bias_constraint": null, "activation": "linear", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "filters": 32, "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "dtype": "float32", "name": "conv2d_1", "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "filters": 32, "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_2", "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_3", "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "units": 64, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "units": 1, "bias_constraint": null, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_5", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.1.3", "class_name": "Sequential"}